# RebarNumberSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarNumberSuffix Property
ParameterTypeId Class See Also
---
"Rebar Number Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarNumberSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarNumberSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarNumberSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace